Repository: mbideau/btrfs-savepoints
Catalog: locale/*/LC_MESSAGES/btrfs-sp-restore-gui.po
Languages: fr

source: No difference found
fr: Aucune différence trouvée

source: No savepoints found
fr: Pas de point de sauvegarde trouvé

source: No configuration found
fr: Pas de configuration trouvée

source: 3 groups of 3 signs ('.', '-', '+', '*'), or a single letter 'v'
fr: 3 groupes de 3 signes ('.', '-', '+', '*'), ou une lettre 'v' unique

source: in any of the 3 groups of 3 signs, a dot '.' means nothing, it is just a visual mark to show that an analysis have been done
fr: dans chacun des 3 groupes de 3 signes, un point '.' ne signifie rien, c'est simplement une marque visuelle pour indiquer qu'une analyse a été faite

source: the first/left group of 3 signs, represent the deletions, the more '-' sign there is the more files were deleted
fr: le premier/gauche groupe de 3 signes, représente les suppressions, plus il y a de signes '-', plus il y a eu des fichiers supprimés

source: the second/middle group of 3 signs, represent the additions, the more '+' sign there is the more files were added
fr: le second/milieu groupe de 3 signes, représente les ajouts, plus il y a de signes '+', plus il y a eu des fichiers ajoutés

source: the single letter 'v' means the savepoint is just a link to the previous/below savepoint
fr: la lettre 'v' unique signifie que le point de sauvegarde n'est qu'un lien vers le précédent/dessous

source: the third/right group of 3 signs, represent the modifications, the more '*' sign there is the more files were modified
fr: le troisème/droite groupe de 3 signes, représente les modifications, plus il y a de signes '*', plus il y a eu des fichiers modifiés

source: Do you want to restore your system from a previous state ?
fr: Voulez-vous restaurer votre système à une date antérieure ?

source: use <tab> to move around selection (i.e.: change button).
fr: utilisez <tab> pour déplacer la sélection (càd: changer de bouton).

source: was not found after the restoration, at :
fr: n'a pas été trouvé après la restauration :

source: %s GUI to restore a folder (BTRFS subvolume) at previous state.
fr: IHM de %s pour restaurer un dossier (sous-volume BTRFS) à un état antérieur.

source: COLUMNS
fr: COLONNES

source: Cancel
fr: Annuler

source: Collecting savepoints for that configuration, and analyzing their differences...
fr: Collecte les points de sauvegardes pour cette configuration, et analyze leurs différences...

source: Continue anyway ?
fr: Continuer quand même ?

source: Default to
fr: Par défaut vaut

source: Default to '%s' binary, then '%s'.
fr: Par défaut c'est le binaire '%s', puis '%s'.

source: Display help message.
fr: Affiche le message d'aide.

source: Example
fr: Exemple

source: FILE
fr: FICHIER

source: Fatal error: binary '%s' not found
fr: Erreur fatale: le binaire '%s' n'a pas été trouvé

source: Fatal error: invalid option
fr: Erreur fatal: option invalide

source: Fatal error: no binary found for handling dialog box (no '%s' nor '%s')
fr: Erreur fatal: aucun binaire trouvé pour gérer les boîtes de dialogue (ni '%s' ni '%s')

source: Force to treat the console as the specified size.
fr: Forcer le traitement de la console selon la taille spécifiée.

source: If the kernel is not found in the subvolume, it offers to reboot at the exit.
fr: Si le noyau n'est pas trouvé dans le sous-volume, cela propose de redémarrer à la fin.

source: In order to create such a theme file
fr: Afin de créer un tel thème

source: Info: use 'arrow keys' to move up/down the list
fr: Info: utilisez les 'touches directionnelles' pour vous déplacer en haut/bas dans la liste

source: Legend: before each savepoint there are one of the following :
fr: Légende: avant chaque point de sauvegarde il y a l'un des éléments suivants :

source: Load the specified theme file.
fr: Charge le fichier de thème spécifié.

source: Made with time, love and passion by Michael Bideau
fr: Fait avec du temps, de l'amour, et de la passion par Michael Bideau

source: More details on the error below.
fr: Plus de détails sur l'erreur ci-dessous.

source: No, thank you
fr: Non, merci

source: Ok, I understand
fr: Ok, je comprends

source: Ok, great
fr: Ok, super

source: Ok, then
fr: Ok, compris

source: PATH
fr: CHEMIN

source: Path to '%s' binary.
fr: Chemin vers le binaire '%s'.

source: Path to '%s' global configuration.
fr: Chemin vers la configuration global de '%s'.

source: Path to a '%s' binary.
fr: Chemin vers un binaire '%s'.

source: Please confirm
fr: Confimez SVP

source: Prefix of the kernel filename.
fr: Préfixe du nom de fichier du noyau.

source: Prefix paths with the specified PATH
fr: Préfiwer les chemins avec le chemin spécifié

source: ROWS
fr: LIGNES

source: Reboot after exiting this program ?
fr: Redémarrer après la fin du programme ?

source: Regular expression to match the name of the '%s' %s configuration.
fr: Expression régulière pour trouver le nom de la configuration %s de '%s'

source: Restoration complete
fr: Restauration complète

source: Restoration has failed.
fr: La restauration a échoué.

source: Restore the BTRFS subvolume
fr: Restaurer le sous-volume BTRFS

source: See also
fr: Voir aussi

source: See the differences with the current state ?
fr: Voir les différences avec l'état actuel ?

source: Select the savepoint to restore from :
fr: Sélectionnez le point de sauvegarde pour la restauration :

source: Select which element you want to restore :
fr: Sélectionnez l'élément que vous voulez restaurer :

source: So you will not be able to boot
fr: Donc vous ne pourrez pas démarrer

source: Suffix of the kernel filename.
fr: Suffixe du nom de fichier du noyau.

source: Then it is up to the calling script to handle the rebooting on behalf of the user.
fr: Puis c'est au script appelant de gérer le rédmarrage selon le souhait de l'utilisateur.

source: There were an error when producing the differences.
fr: Il y a eu une erreur pendant la production des différences.

source: This might take a few seconds and sometimes a few minutes.
fr: Cela peut prendre quelques secondes et parfois quelques minutes.

source: When restoring that configuration's subvolume
fr: Lors de la restauration du sous-volume de cette configuration

source: When the user ask for reboot, it will not really reboot, but just exit with return code '3'.
fr: Lorsque l'utilisateur demande le redémarrage, le redémarrage ne sera pas réellement effectué, le script se contentera de terminer avec le code retour '3'.

source: Yes
fr: Oui

source: Yes, please
fr: Oui, SVP

source: You should define the following variables according to the %s documentation for '%s' :
fr: Vous devrez définir les variables suivantes selon la documentation de %s pour '%s' :

source: Your currently running system's kernel '%s'
fr: Votre noyau système actuellement en fonctionnement '%s'

source: and together they form a representation of the differences with the previous/below savepoint
fr: et ensemble cela forme une représentation des différences avec le précédent/dessous point de sauvegarde

source: before your system has rebooted.
fr: avant que votre système n'ait rebooté.

source: from the savepoint
fr: depuis le point de sauvegarde

source: it checks that the current kernel is still present in the restored one.
fr: cela vérifie que le noyau courant est toujours présent parmis ceux restaurés.

source: see '%s' documentation.
fr: Voir la documentation de '%s'.

source: system's restoration, thanks to BTRFS snapshots
fr: restauration du système, grâce aux snapshots BTRFS

source: then press <space> to select an item
fr: puis appuyez sur <espace> pour sélectionner un élément
