Repository: mbideau/btrfs-savepoints
Catalog: locale/*/LC_MESSAGES/btrfs-sp.po
Languages: fr

source: (available: %.1f Gb, limit: %.1f Gb)
fr: (disponible %.1f Gb, limite: %.1f Gb)

source: A datetime (Y-m-d H:M:S) that defines the restoration event date time.
fr: Une date-temps (Y-m-d H:M:S) qui définie la date-temps de l'évènement de la restoration.

source: A datetime (Y-m-d H:M:S) that defines the savepoint taking date time.
fr: Une date-temps (Y-m-d H:M:S) qui définie la date-temps à la création du point de sauvegarde.

source: A datetime (Y-m-d H:M:S) that indicate when is "now".
fr: Une date-temps (Y-m-d H:M:S) qui indique quand est "maintenant".

source: A moment name in the system execution. It can be :
fr: Le nom d'un moment dans l'exécution du système. Cela peut être :

source: A suffix to add to the savepoint filename.
fr: Un suffix à ajouter au nom de fichier du point de sauvegarde

source: AUTHORS
fr: AUTEURS

source: Add/write something to the persistent log.
fr: Ajoute/écrit quelque chose au log persistent.

source: Allowed values are the following
fr: Les valeurs autorisée sont

source: By commands
fr: Par commandes

source: By default, the savepoint may not be really removed, but instead just be renamed/moved up if a newer symlink where pointing at it, it will just replace that symlink.
fr: Par défaut, les points de sauvegarde peuvent ne pas être supprimés, mais à la place, simplement être renommés/déplacés si un lien symbolique plus récent pointent vers eux, cela va juste remplacer ce lien symbolique.

source: COMMAND
fr: COMMANDE

source: COMMANDS
fr: COMMANDES

source: Cannot produce a diff without '%s' binary (%s)
fr: Impossible d'analyser les différences sans le binaire '%s' (%s)

source: Configuration '%s' created to '%s'%s
fr: Configuration '%s' créée à '%s'%s

source: Configuration variables '%s' must be defined.
fr: La variable de configuration '%s' doit être définie.

source: Create a new savepoint configuration.
fr: Crée une nouvelle configuration de points de sauvegarde.

source: DAY
fr: JOUR

source: Default savepoint variables in the global configuration
fr: Les variables par défaut du point de sauvegarde dans la configuration globale

source: Default to
fr: Par défaut est

source: Directory where to find the configurations for each managed folder.
fr: Répertoire où trouver les configurations pour chaque dossier géré

source: Directory where to find the configurations.
fr: Répertoire où trouver les configurations.

source: Display help message about the configuration.
fr: Affiche le message d'aide à propos de la configuration.

source: Display help message.
fr: Affiche le message d'aide.

source: Display version and license informations.
fr: Afficher les informations de version et de licence.

source: Do not copy all the savepoint configuration defaults to the new configuration file.
fr: Ne pas copier la configuration par défaut du point de sauvegarde dans la nouveau fichier de configuration.

source: Do not ignore the patterns configured with the variable '%s'.
fr: Ne pas ignorer les motifs configurés avec la variable '%s'.

source: Do not trigger the '%s' algorith after a savepoint creation.
fr: Ne pas déclencher l'algorithme '%s' après la création d'un point de sauvegarde

source: Do not trigger the purging of savepoint based on differences.
fr: Ne pas déclencher la purge des points de sauvegarde basée sur les différences

source: Do not trigger the purging of savepoint based on numbers.
fr: Ne pas déclencher la purge des points de sauvegarde basée sur les nombres

source: Do not use it manually from command line (except for testing puppose).
fr: Ne pas utiliser manuellement avec la ligne de commande (sauf lors de tests).

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: EXAMPLES
fr: EXEMPLES

source: Example
fr: Exemple

source: Example (recommended)
fr: Exemple (recommandé)

source: Except for the %s hooks that will only have the 2nd one.
fr: Sauf pour le hook %s qui n'aura que le second.

source: Except for the '%s' and '%s' variables, for which it would makes no sense.
fr: Sauf pour les variables '%s' et '%s', pour lesquelles ça n'aurait pas de sens.

source: FILES
fr: FICHIERS

source: Failed to create snapshot (ro) from '%s' to '%s'
fr: Échec de la création d'un snapshot (ro) depuis '%s' vers '%s'

source: Fatal error
fr: Erreur fatal

source: File for local overrides of global configuration.
fr: Fichier pour les surcharges locales de la configuration globale.

source: Final savepoints directory for configuration '%s', will be :
fr: Le répertoire final des points de sauvegarde pour la configuration '%s', sera :

source: For all commands
fr: Pour toutes les commandes

source: For each configuration, may create a new snapshot and do pruning.
fr: Pour chaque configuration, peut créer un nouveau snapshot et purger.

source: For the root filesystem '%s' mounted at '%s'
fr: Pour le système de fichier racine '%s' monté sur '%s'

source: Format the output for the restoration GUI.
fr: Formatter l'affichage pour l'interface de restauration.

source: Get differences between current subvolume and a savepoint (of the same configuration).
fr: Analyse les différences entre le sous-volume et un point de sauvegardes (de la même configuration).

source: Get differences between two savepoints (of the same configuration).
fr: Analyse les différences entre deux points de sauvegardes (de la même configuration).

source: Get the differences between two snapshots.
fr: Obtenir les différences entre deux points de sauvegardes.

source: Global variables
fr: Variable globales

source: HOUR
fr: HEURE

source: Hence that important feature/option.
fr: D'où cette importante fonctionnalité/option.

source: Home page
fr: Page d'accueil

source: How much backup to keep.
fr: Combien de sauvegardes à conserver

source: How much free space to preserve (in Gb).
fr: Combien d'espace libre préserver (en Gb).

source: If the persistent log is on a subvolume '%s' mounted at '%s'
fr: Si le log persistant est sur un sous-volume '%s' monté sur '%s'

source: If the savepoints dir is on a subvolume '%s' mounted at '%s'
fr: Si le point de sauvegarde est sur un sous-volume '%s' monté sur '%s'

source: If the system was not properly stopped or is running with rootfs mounted,
fr: Si le système n'a pas été éteint correctement ou s'il est en cours de fonctionnement avec le système de fichier racine monté,

source: In order to really delete it and all the symlinks pointing at it (recursively), that option must be specified.
fr: Afin de vraiment le supprimer et tout les liens symboliques le pointaint (récursivement), cette option doit être spécifiée.

source: Indicate that the savepoint should be considered/flagged as a safe one.
fr: Indique que le point de sauvegarde doit être considéré comme sûr.

source: Influence the translation.
fr: Influence la traduction.

source: It is recommended to put it where the backups are, at the root of the backups dir.
fr: Il est recommandé de le mettre là où les sauvegardes sont, à la racine du répertoire des sauvegardes.

source: It is the same as the '%s' options parameter, when mounting the subvolume.
fr: C'est identique au paramètre d'option '%s', lors du montage du sous-volume.haut niveau.

source: It normaly happens after a savepoint have been created.
fr: Se produit normalement après qu'un point de sauvegarde ait été créé.

source: Just use the same as the savepoint variables (below), but prefix them by: '%s' (i.e.: %s).
fr: Simplement utiliser les mêmes variables que celles du point de sauvegarde (ci-dessous), mais préfixée par: '%s' (ex: %s)

source: License %s: %s <%s>
fr: Licence %s: %s <%s>

source: List all the savepoints.
fr: Lister les points de sauvegarde.

source: List the configurations.
fr: Lister les configurations.

source: MONTH
fr: MOIS

source: MOUNTED_PATH
fr: CHEMIN_MONTÉ

source: Mainly used for purging backup based on number refering to a unit of time.
fr: Principalement utilisé pour la purge des sauvegardes sur la base des nombres, d'après une unité de temps.

source: Meant to be used only when executed by a %s unit.
fr: Prévu pour être utilisé seulement lorsqu'exécuté par une unité %s.

source: Meant to be used only when executed by an %s script.
fr: Prévu pour être utilisé seulement lorsqu'exécuté par un script %s.

source: Name of the configuration
fr: Nom de la configuration

source: Not yet used.
fr: Pas encore utilisé.

source: Only alphanum characters are allowed, plus the following: '%s'.
fr: Sont autorisés uniquement les caractères alphanumériques, plus les suivants: '%s'.

source: Only reboot/shutdown are recommended because it ensures the system has properly stopped.
fr: Seulement 'reboot/shutdown' sont recommandés car ils assurent que le système a été éteint correctement.

source: Only savepoint that are made when the system is not running and was properly stoped, should be considered safe. Which are the following cases :
fr: Seulement les sauvegardes qui ont été faites lorsque le système n'était pas en fonctionnement et après une extinction propre, devraient être considérées comme sûres. Ce qui correspond aux cas suivants :

source: Path of the savepoints dir relative to the BTRFS top level subvolume %s.
fr: Chemin du dossier des points de sauvegarde relatif au sous-volume BTRFS de plus haut niveau %s.

source: Path of the subvolume relative to the BTRFS top level subvolume %s.
fr: Chemin du dossier du sous-volume relatif au sous-volume BTRFS de plus haut niveau %s.

source: Path to a 'persistent' text file (that will not be affected by rollbacks).
fr: Chemin vers un fichier texte 'persistant' (qui ne sera pas affecté par les restaurations).

source: Path to a global configuration file.
fr: Chemin vers le fichier de configuration globale.

source: Paths relatives to the BTRFS top level subvolume %s.
fr: Chemins relatifs au sous-volume BTRFS de plus haut niveau %s.

source: Prefix paths with the specified PATH
fr: Préfixe les chemins par le CHEMIN spécifié

source: Print debuging information to '%s' only if %s='%s'.
fr: Afficher les informations de debug sur '%s' seulement si %s='%s'.

source: Print/read the persistent log.
fr: Affiche/lit le log persistant.

source: REPORTING BUGS
fr: RAPPORTER LES BUGS

source: Remove savepoints.
fr: Supprimer les points de sauvegarde.

source: Report bugs to
fr: Rapporter les bugs à

source: Restore/replace the current BTRFS subvolume with the specified savepoint.
fr: Restaurer/remplacer le sous-volume BTRFS courant avec le point de sauvegarde spécifié.

source: Retention
fr: Rétention

source: Run the pruning algorithm (same as '%s' then '%s').
fr: Lancer l'algorithme de purge (identique à '%s' puis '%s').

source: Run the purge-diff algorithm, that replace savepoints that have no differences by a symlink.
fr: Lancer l'algorithme de purge 'purge-diff', qui remplace les points de sauvegarde qui n'ont pas de différences par un lien symbolique.

source: Run the purge-number algorithm that delete savepoints based on a retention strategy that keep X savepoints for each kind of time unit (sessions, minutes, hours, days, weeks, months, years).
fr: Lancer l'algorithme de purge 'purge-number' qui supprime les points de sauvegarde selon une stratégie de rétention qui conserve X éléments pour chaque type d'unité de temps (sessions, minutes, heures, jours, semaines, mois, années).

source: SAVEPOINT
fr: POINT_DE_SAUVEGARDE

source: SAVEPOINTS
fr: POINTS_DE_SAUVEGARDE

source: SEE ALSO
fr: VOIR AUSSI

source: SESSION: between BOOT/RESUME and one of REBOOT/SHUTDOWN/HALT/SUSPEND
fr: SESSION: entre le DÉMARRAGE/RÉVEIL et le REDÉMARRAGE/l'EXTINCTION/l'ARRÊT/la MISE EN VEILLE

source: SP_CMP
fr: PS_CMP

source: SP_REF
fr: PS_REF

source: SUBVOL_PATH
fr: SOUS_VOLUME

source: Savepoint configuration variables
fr: Variables pour la configuration des points de sauvegarde

source: See %s documentation.
fr: Voir la documentation de %s.

source: See the option '%s' or the man page '%s'.
fr: Voir l'option '%s' ou la page de manuel '%s'.

source: Skip checking free space
fr: Ignorer la vérificatin d'espace libre

source: Success
fr: Succès

source: The (mounted) subvolume path to manage (backup/restore).
fr: Le chemin du sous-volume (monté) à gérer (sauvegarder/restaurer).

source: The BTRFS subvolume '%s' doesn't exist
fr: Le sous-volume BTRFS '%s' n'existe pas

source: The backup directory must be reachable inside the top level BTRFS filesystem mount.
fr: Le répertoire de sauvegardes doit être accessible depuis le point de montage du sous-volume BTRFS de plus haut niveau

source: The command '%s' requires a configuration
fr: La commande '%s' requiert une configuration

source: The default configuration path for local overrides.
fr: Le chemin de configuration par défault pour les surcharges locales.

source: The default global configuration path (if not overriden with option %s).
fr: Le chemin de la configuration globale (si non redéfinie par l'option '%s').

source: The hook command will be executed by '%s'.
fr: La command 'hameçon' sera exécutée par '%s'.

source: The hook command will be suffixed with 2 arguments
fr: La command 'hameçon' sera suffixée par 2 arguments.

source: The path is relative to the BTRFS top level subvolume.
fr: Le chemin est relatif au sous-volume BTRFS de plus haut niveau.

source: There is NO WARRANTY, to the extent permitted by law.
fr: Il n'y aucune GARANTIE, dans la limite de ce que permet la loi.

source: There was an error when producing the diff between BTRFS subvolumes '%s' and '%s'
fr: Il y a eu une erreur pendant l'analyse des différences entre les deux sous-volumes BTRFS '%s' et '%s'

source: This implies that it must be in the same BTRFS filesystem than the backuped subvolumes (and also because of '%s').
fr: Ceci implique qu'il doit être dans le même système de fichiers BTRFS que les sous-volumes sauvegardés (et aussi à cause de '%s'

source: This is free software: you are free to change and redistribute it.
fr: Ceci est un logiciel libre: vous être libre de le modifier et de le redistribuer.

source: This is mainly used in initramfs or systemd unit when root filesystem is not mounted
fr: C'est principalement utilisé dans l'initramfs ou une unité systemd lorsque le sysètme de fichier racine n'est pas monté

source: This path should belong to a mounted BTRFS subvolume.
fr: Ce chemin devrait appartenir à un sous-volume BTRFS monté.

source: Use the 'no-session' algorithm when pruning savepoints.
fr: Utiliser l'algorithm 'no-session' lors de la purge des points de sauvegarde.

source: Values allowed are:
fr: Les valeurs autorisées sont:

source: WEEK
fr: SEMAINE

source: Warning
fr: Avertissement

source: What action to do when there is not enough free space according to the variable %s.
fr: Quelle action effectuer lorsqu'il n'y a plus assez d'espace libre disponible en fonction de la variable '%s'.

source: What patterns to ignores when comparing savepoints.
fr: Quels motifs à ignorer lors de la comparaison des points de sauvegarde.

source: What to execute before/after backuping and/or restoring.
fr: Quoi exécuter avant/après une sauvegarde et/ou une restoration

source: When it is considered a safe backup.
fr: Quand la sauvegarde est considérée sûre.

source: When it should be automatically backuped.
fr: Quand la sauvegarde doit avoir lieu.

source: When specified, will understand that it is executed in the initramfs
fr: Lorsque spécifié, comprendra que l'exécution a lieu dans l'initramfs

source: When specified, will understand that it is executed in the systemd LSB context
fr: Lorsque spécifié, comprendra que l'exécution a lieu dans le contexte LSB de systemd

source: Where the '%s' is the path of a shell script (called with '%s' binary)
fr: Où '%s' est le chemin d'un script shell (appelée avec le binaire '%s')

source: Where to backup the savepoint.
fr: Où sauvegarder le dossier.

source: With what suffix.
fr: Avec quel suffixe.

source: Written by
fr: Écrit par

source: YEAR
fr: ANNÉE

source: You might want to create one with command '%s'
fr: Vous pourriez vouloir en créer une avec la commande '%s'

source: added
fr: ajouté

source: and have the following argument (in that order) :
fr: et a les arguments suivants (dans cet ordre) :

source: argument '%s' is not defined
fr: l'argument '%s' n'est pas défini

source: backup and restore instantly with ease your BTRFS filesystem.
fr: sauvegarder et restaurer instantanément avec facilité votre système de fichier BTRFS

source: binary '%s' not found
fr: binaire '%s' non-trouvé

source: boot (before mounting rootfs) if properly stopped before
fr: au démarrage (avant de monter le système de fichier racine) si correctement éteint avant

source: but instead the whole BTRFS tree is mounted at PATH (with the subvolume '%s').
fr: mais à la place l'ensemble de l'arborescence BTRFS est montée sur PATH (avec le sous-volume '%s').

source: changed
fr: changé

source: configuration file '%s' already exists
fr: le fichier de configuration '%s' existe déjà

source: configuration file '%s' doesn't exist or isn't readable
fr: le fichier de configuration '%s' n'existe pas ou n'est pas lisible

source: configuration not found ('%s' doesn't exist)
fr: configuration '%s' non-trouvée ('%s' n'existe pas)

source: configurations directory is not defined (use variable '%s')
fr: le répertoire de configuration n'est pas défini (utilisez la variable '%s')

source: current free space available (in %s)
fr: espace libre disponible actuel (en %s)

source: default
fr: par défaut

source: deleted
fr: supprimé

source: failed to create snapshot (ro) from '%s' to '%s'
fr: échec de la création d'un snapshot (ro) depuis '%s' vers '%s'

source: failed to create snapshot (rw) from '%s' to '%s'
fr: échec de la création d'un snapshot (rw) depuis '%s' vers '%s'

source: failed to delete new snapshot '%s'
fr: échec de la suppression du nouveau snapshot '%s'

source: failed to delete savepoint '%s'
fr: échec de la suppression du point de sauvegarde '%s'

source: failed to delete subvolume '%s'
fr: échec de la suppression du sous-volume '%s'

source: failed to get a date from filename '%s'
fr: impossible d'obtenir une date à partir du nom de fichier '%s'

source: failed to get avalable free space for '%s'
fr: impossible d'obtenir l'espace libre disponible pour '%s'

source: failed to get mount point for '%s'
fr: impossible de trouver le point de montage pour '%s'

source: failed to get the date from the savepoint '%s'
fr: impossible d'obtenir la date pour le point de sauvegarde '%s'

source: failed to get the list of backups for directory '%s'
fr: impossible d'obtenir la liste des sauvegardes pour le dossier '%s'

source: failed to get the week days for datetime '%s'
fr: impossible d'obtenir les jours de la semaine pour la date-temps '%s'

source: failed to get week day of datetime '%s'
fr: impossible d'obtenir le jour de semaine de la date-temps '%s'

source: failed to snapshot '%s' to '%s'
fr: échec du snapshoting de '%s' vers '%s'

source: folder '%s' is not a BTRFS subvolume
fr: le dossier '%s' n'est pas un sous-volume

source: if restored, will restore an unstable/incoherent system.
fr: si restauré, restaurera un système instable/incohérent.

source: instead of paths relative to mounted root filesystem
fr: au lieu des chemins relatifs au système de fichier racine monté

source: invalid boolean value '%s' (variable: '%s')
fr: valeur booléenne '%s' invalide (variable: '%s')

source: invalid command '%s'
fr: commande '%s' invalide

source: invalid configuration's name '%s'
fr: nom de configuration '%s' invalide

source: invalid date option '%s'
fr: optioin de date '%s' invalide

source: invalid decimal number value '%s' (variable: '%s')
fr: valeur décimale '%s' invalide (variable: '%s')

source: invalid option
fr: option invalide

source: invalid positive number value '%s' (variable: '%s')
fr: valeur d'entier positif '%s' invalide (variable: '%s')

source: invalid value '%s' for option %s
fr: valeur '%s' invalide pour l'option '%s'

source: invalid value for global variable '%s' (%s)
fr: valeur invalide pour la variable globale '%s' (%s)

source: it can cause savepoint to be made meanwhile the state of an application is not coherent, and then,
fr: cela peut donner lieu à la création d'un point de sauvegarde pendant que l'état d'une application n'est pas cohérent, et ensuite,

source: limit of free space required (in %s)
fr: limite d'espace libre requis (en %s)

source: meaning :
fr: ce qui signifie :

source: no configuration yet.
fr: pas encore de configuration.

source: no configurations directory at '%s'
fr: aucun répertoire de configurations à '%s'.

source: not enough free space for path '%s'
fr: pas assez d'espace disque libre pour le chemin '%s'

source: offline using a LIVE system if properly stopped before
fr: hors-ligne en utilisant un système LIVE, si il a d'abord été éteint correctement

source: options '%s' and '%s' can not be specified simultaneously
fr: Les options '%s' et '%s' ne peuvent pas être spécifiées en même temps

source: path '%s' is not a folder
fr: le chemin '%s' n'est pas un dossier

source: path of the file or directory considered
fr: chemin du fichier ou dossier considéré

source: persistent log is not defined (use variable '%s')
fr: le log persistant n'est pas défini (utilisez la variable '%s')

source: pruning savepoints have failed
fr: la purge des points de sauvegarde a échoué

source: pruning savepoints using '%s' algorithm has failed
fr: purger les points de sauvegarde avec l'algorithme '%s' a échoué

source: reboot/shutdown
fr: au redémarrage/à l'extinction

source: replacing error and message functions with the one from the helper script
fr: remplace les erreurs et les fonctions de messages par ceux du script utilitaire

source: savepoint '%s' doesn't exist
fr: le point de sauvegarde '%s' n'existe pas

source: savepoints dir is not defined (use variable '%s')
fr: le dossier des points de sauvegarde n'est pas défini (utilisez la variable '%s')

source: shell script '%s' doesn't exist
fr: le script shell '%s' n'existe pas

source: shell script '%s' has failed (arguments: %s)
fr: le script shell '%s' a échoué (arguments: %s)

source: the BTRFS subvolume considered for the operation
fr: le sous-volume BTRFS considéré pour l'opération

source: the folder at '%s' is not a subvolume
fr: le dossier '%s' n'est pas un sous-volume

source: the savepoint '%s' already exists ! (bug ?)
fr: le point de sauvegarde '%s' existe déjà ! (bug ?)

source: the savepoint '%s' doesn't exist
fr: le point de sauvegarde '%s' n'existe pas

source: the savepoint '%s' is a link to '%s', that doesn't belong to savepoints dir '%s'
fr: le point de sauvegarde '%s' est un lien vers '%s', qui n'appartient pas au dossier des points de sauvegarde '%s'

source: the savepoint considered for the operation
fr: le point de sauvegarde considéré pour l'opération

source: the version '%s' is required for the binary '%s'
fr: la version '%s' est requise pour le binaire '%s'

source: then add the relatives prefixes from BTRFS top level subvolume
fr: puis ajoute les préfixes relatifs au sous-volume BTRFS de plus haut niveau

source: trying to source the helper function script at :
fr: essaie de sourcer le script utilitaire :

source: using a custom shell script
fr: utilisant un script shell personnel

source: using a shell command ignoring the 2 arguments
fr: utilisant une commande shell ignorant les 2 arguments

source: with default values
fr: avec les valeurs par défaut
