Repository: mbideau/btrfs-savepoints
Catalog: locale/*/LC_MESSAGES/btrfs-sp-initramfs-script.po
Languages: fr

source: BTRFS SavePoint created
fr: Point de sauvegarde BTRFS créé

source: BTRFS SavePoint creation failed
fr: Échec de la création d'un point de sauvegarde BTRFS

source: See log at : %s
fr: Voir les logs: %s

source: reboot and hit '%s' at startup
fr: redémarrez et appuyez sur '%s' au démarrage

source: To restore the system to a previous state
fr: Pour restaurer le système à un état précédent

source: %d seconds left
fr: %d secondes restantes

source: Hit '%s' to enter BTRFS SavePoint restoration GUI
fr: Appuyez sur '%s' pour lancer l'interface de restauration des points de sauvegarde BTRFS

source: Press '%s' key
fr: Appuyez sur '%s'

source: Rebooting now
fr: Va redemarrer

source: the BTRFS SavePoint restoration GUI
fr: l'interface de restauration des points de sauvegarde BTRFS

source: to enter
fr: pour lancer
